Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/The Grails Framework 2.0.0 - Reference Documentation-level2.tmx
Source language: en_us
Languages: ru_ru

source: To update an instance, change some properties and then call save again:
ru_ru: Для обновления экземпляра, измените какие-нибудь свойства, а затем снова вызовите метод save:

source: Try performing some basic CRUD (Create/Read/Update/Delete) operations.
ru_ru: Попробуем выполнить некоторые основные операции CRUD (Create/Read/Update/Delete).

source: Under the hood it uses Hibernate 3 (a very popular and flexible open source ORM solution) and thanks to the dynamic nature of Groovy with its static and dynamic typing, along with the convention of Grails, there is far less configuration involved in creating Grails domain classes.
ru_ru: Под капотом она использует Hibernate 3 (очень популярное и гибкое open source ORM решение) и благодаря динамической натуре Groovy с его статической и динамической типизацией, вместе с соглашениями Grails, содержит намного меньше конфигурации, учавствующей в создании доменных классов Grails.

source: Unit Testing GORM
ru_ru: Unit тестирование GORM

source: Unless specified explicitly at both ends, a relationship exists only in the direction it is defined.
ru_ru: Связь существует только в том направлении, в каком определена, если явно не указано на обоих концах.

source: Usage
ru_ru: Использование

source: Usage (optionals marked with *): grails [environment]* [target] [arguments]*
ru_ru: Использование (необязательные отмечены знаком *): grails [environment]* [target] [arguments]*

source: Use a TOC for Project Docs
ru_ru: Использование TOC для Документации Проекта

source: War generation
ru_ru: Генерация War

source: We'll talk some more about this in the next section.
ru_ru: Мы поговорим еще об этом в следующем разделе.

source: Web Features
ru_ru: Особенности Веб

source: What does that mean?
ru_ru: Что это значит?

source: What makes it different, however, is that it does so by building on already established Java technologies like Spring and Hibernate.
ru_ru: Однако он отличается тем, что он делает это опираясь на уже существующие технологии Java, такие как Spring и Hibernate.

source: What's new in Grails 2.0?
ru_ru: Что нового в Grails 2.0?

source: When Grails executes a Gant script, it invokes the "default" target defined in that script.
ru_ru: Когда Grails выполняет скрипт Gant, он вызывает цель "по умолчанию", определенную в этом скрипте.

source: When building Grails applications you have to consider the problem domain you are trying to solve.
ru_ru: При создании приложения Grails вы должны решить проблемму доменных классов.

source: When using a List, elements must be added to the collection before being saved, otherwise Hibernate will throw an exception (org.hibernate.HibernateException: null index column for collection):
ru_ru: Когда используется List, элементы должны быть добавлены в коллекцию до сохранения, иначе Hibernate бросит исключение (org.hibernate.HibernateException: null index column for collection):

source: When you log a message, you implicitly give that message a level.
ru_ru: Когда вы регистрируете сообщение, вы неявно даете этому сообщению уровень.

source: When you run a script manually and it prompts you for information, you can answer the questions and continue running the script.
ru_ru: Когда вы вручную запускаете скрипт, и он запрашивает у вас некоторую информацию, вы можете ответить на вопросы и продолжить выполнение скрипта.

source: When you type:
ru_ru: Когда вы вводите:

source: Which approach is better?
ru_ru: Какой подход лучше?

source: Will create a script called scripts/CompileSources.groovy.
ru_ru: создаст скрипт scripts/CompileSources.groovy.

source: With Grails you define such a relationship with the hasMany setting:
ru_ru: В Grails вы определяете такие отношения свойством hasMany:

source: With Grails' default settings you can actually develop an application without doing any configuration whatsoever.
ru_ru: С настройками Grails' по умолчанию, вы можете разрабатывать настоящие приложения не производя какие бы то ни было настройки.

source: You can add your own configuration in here, for example:
ru_ru: Здесь вы можете добавить собственную конфигурацию, например:

source: You can also "depend" on other targets using the depends method demonstrated in the default target above.
ru_ru: Вы можете также "зависеть" от других целей, используя метод depends показанный в цели default выше.

source: You can also load an object in a read-only state by using the read method:
ru_ru: Также вы можете загрузить объект в режиме "только для чтения" использовав метод read:

source: You can also pass a name to the getLog() method, such as "myLogger", but this is less common because the logging system treats names with dots ('.') in a special way.
ru_ru: Также, вы можете передать имя>, такое как "myLogger" в метод getLog()</c0, но это реже, так как система регистрации рассматривает имена с точками (".") по-особому.

source: You can also write Grails domain classes in Java.
ru_ru: Также вы можете написать доменные классы Grails на Java.

source: You can alter various aspects of how the join table is mapped using the joinTable argument:
ru_ru: Вы можете менять различные аспекты того, как отображать присоединенную таблицу, используя аргумент joinTable:

source: You can change the ivy cache directory for all projects via settings.groovy
ru_ru: Вы можете изменить каталог кэша ivy для всех проектов через settings.groovy

source: You can create your own Gant scripts by running the create-script command from the root of your project.
ru_ru: Вы можете создавать ваши собственные скрипты Gant запустив команду create-script в корневом каталоге вашего проекта.

source: You can customize the class by adding properties:
ru_ru: Вы можете настроить класс, добавив свойства:

source: You can define an action that declares arguments for each input and automatically converts the parameters to the appropriate type:
ru_ru: Вы можете опредлить акцию, в которой обьявлены аргументы для каждого элемента управления input и которые автоматически конвертируются в соответствующий тип.

source: You can even open multiple files at once: open test-report test/unit/MyTests.groovy will open the HTML test report in your browser and the MyTests.groovy source file in your text editor.
ru_ru: Вы можете даже открыть несколько файлов одновременно: команда open test-report test/unit/MyTests.groovy откроет отчет о тестировании в вашем браузере а команда MyTests.groovy файл с исходниками в вашем текстовом редакторе.

source: You can now use logical names for your gdoc files and define the structure and section titles in a YAML table-of-contents file, as described in the section on the documentation engine.
ru_ru: Теперь вы можете использовать логические имена для gdoc файлов, определять структуру и разделять заголовки в файле оглавления YAML, как описано в разделе по механизму документации.

source: You can then depend upon or invoke those targets as if they had been defined in the current script.
ru_ru: Вы можете зависеть от них, или ссылаться на эти цели, как если бы они были определены в текущем сценарии.

source: You could also model the collection as a Hibernate Bag as described above.
ru_ru: Кроме того, можно моделировать коллекции типа Hibernate Bag, как описано выше.

source: You have already seen how to configure loggers in Grails:
ru_ru: Вы уже видели, как настраиваются регистраторы в Grails:

source: author.books[0] // get the first book
ru_ru: author.books[0] // получить первую книгу

source: bunch_o_nicknames Table
ru_ru: Таблица bunch_o_nicknames

source: checksums false // whether to verify checksums or not }
ru_ru: checksums false // проверять контрольную сумму или нет }

source: def content = Content.list() // list all blog entries, books and podcasts content = Content.findAllByAuthor('Joe Bloggs') // find all by author
ru_ru: def content = Content.list() // список всех записей блогов, книг и подкастов content = Content.findAllByAuthor('Joe Bloggs') // найдет все по автору

source: def f = Face.get(1) f.delete() // both Face and Nose deleted
ru_ru: def f = Face.get(1) f.delete() // как Face так и Nose удалены

source: def podCasts = PodCast.list() // list only podcasts
ru_ru: def podCasts = PodCast.list() // только список подкастов

source: error 'org.codehaus.groovy.grails.web.servlet', // controllers
ru_ru: error 'org.codehaus.groovy.grails.web.servlet', // контроллеры

source: grails [command name]
ru_ru: grails [имя команды]

source: inherits false // Whether to inherit repository definitions from plugins
ru_ru: inherits false //Наследовать ли определения репозитариев из плагинов

source: jQuery by Default
ru_ru: jQuery по умолчанию

source: non-interactive mode
ru_ru: Неинтерактивный режим

source: then messages with a level of 'warn', 'error', or 'fatal' will be written out.
ru_ru: то будут выводиться сообщения уровня 'warn', 'error', или 'fatal'.

source: then the name of the logger will be 'grails.app.service.org.example.MyService'.
ru_ru: то имя регистратора должно быть 'grails.app.service.org.example.MyService'.

source: use the log instance injected into artifacts such as domain classes, controllers and services;
ru_ru: использовать экземпляр log, внедренный в артефакты, такие как доменные классы, контроллеры и сервисы;

source: use the Commons Logging API directly.
ru_ru: напрямую использовать Commons Logging API.

source: which outputs usage instructions and the list of commands Grails is aware of:
ru_ru: которая выдаст инструкции по использованию и список команд доступных в Grails:

source: } // action as a closure def index = {
ru_ru: } // акция как замыкание def index = {
